# Cleaning df_final_demo

In [1]:
import pandas as pd

In [2]:
df_final_demo = pd.read_csv('data raw/df_final_demo.txt')

In [3]:
df_final_demo.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [4]:
df_final_demo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   client_id         70609 non-null  int64
 1   clnt_tenure_yr    70595 non-null  float64
 2   clnt_tenure_mnth  70595 non-null  float64
 3   clnt_age          70594 non-null  float64
 4   gendr             70595 non-null  object
 5   num_accts         70595 non-null  float64
 6   bal               70595 non-null  float64
 7   calls_6_mnth      70595 non-null  float64
 8   logons_6_mnth     70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [5]:
df_final_demo.describe().round(2)

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,num_accts,bal,calls_6_mnth,logons_6_mnth
count,70609.00,70595.00,70595.00,70594.00,70595.00,70595.00,70595.00,70595.00
mean,5004991.88,12.05,150.66,46.44,2.26,147445.24,3.38,5.57
std,2877277.63,6.87,82.09,15.59,0.53,301508.71,2.24,2.35
min,169.00,2.00,33.00,13.50,1.00,13789.42,0.00,1.00
25%,2519329.00,6.00,82.00,32.50,2.00,37346.84,1.00,4.00
50%,5016978.00,11.00,136.00,47.00,2.00,63332.90,3.00,5.00
75%,7483085.00,16.00,192.00,59.00,2.00,137544.90,6.00,7.00
max,9999839.00,62.00,749.00,96.00,8.00,16320040.15,7.00,9.00

### Renaming columns with clear names

In [6]:
df_final_demo = df_final_demo.rename(columns={
    'client_id' : 'client_id',
    'clnt_tenure_yr': 'membership_years',
    'clnt_tenure_mnth': 'membership_months',
    'clnt_age' : 'client_age',
    'gendr'  : 'gender',
    'num_accts' : 'num_accounts',
    'bal' : 'total_account_balance',
    'calls_6_mnth' : 'num_calls_last_6_months',
    'logons_6_mnth' : 'num_logins_last_6_months'
    })

In [7]:
df_final_demo.head()

,client_id,membership_years,membership_months,client_age,gender,num_accounts,total_account_balance,num_calls_last_6_months,num_logins_last_6_months
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

### Cheking for nulls

In [8]:
df_final_demo.isna().sum()

client_id                    0
membership_years            14
membership_months           14
client_age                  15
gender                      14
num_accounts                14
total_account_balance       14
num_calls_last_6_months     14
num_logins_last_6_months    14
dtype: int64

In [9]:
cols_with_nulls = [
    'membership_years',
    'membership_months',
    'client_age',
    'gender',
    'num_accounts',
    'total_account_balance',
    'num_calls_last_6_months',
    'num_logins_last_6_months'
]

rows_with_nulls = df_final_demo[df_final_demo[cols_with_nulls].isna().any(axis=1)]
rows_with_nulls

,client_id,membership_years,membership_months,client_age,gender,num_accounts,total_account_balance,num_calls_last_6_months,num_logins_last_6_months
4164,7402828,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8316,355337,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8677,8412164,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9583,4666211,8.0,106.0,NaN,F,2.0,42550.55,4.0,7.0
13444,2222915,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18066,4876926,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25961,5277910,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28432,7616759,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35323,8191345,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
43518,1227228,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
46076,8611797,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47189,5144725,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
49846,1037867,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
63701,1618749,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
66219,6021001,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Removing rows with nulls

In [10]:
cols_with_nulls = [
    'membership_years',
    'membership_months',
    'client_age',
    'gender',
    'num_accounts',
    'total_account_balance',
    'num_calls_last_6_months',
    'num_logins_last_6_months'
]

df_final_demo = df_final_demo.dropna(subset=cols_with_nulls)

In [11]:
df_final_demo.isna().sum()

client_id                   0
membership_years            0
membership_months           0
client_age                  0
gender                      0
num_accounts                0
total_account_balance       0
num_calls_last_6_months     0
num_logins_last_6_months    0
dtype: int64

In [12]:
df_final_demo.info()

<class 'pandas.core.frame.DataFrame'>
Index: 70594 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   client_id                 70594 non-null  int64
 1   membership_years          70594 non-null  float64
 2   membership_months         70594 non-null  float64
 3   client_age                70594 non-null  float64
 4   gender                    70594 non-null  object
 5   num_accounts              70594 non-null  float64
 6   total_account_balance     70594 non-null  float64
 7   num_calls_last_6_months   70594 non-null  float64
 8   num_logins_last_6_months  70594 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 5.4+ MB

In [13]:
df_final_demo.sample(20)

,client_id,membership_years,membership_months,client_age,gender,num_accounts,total_account_balance,num_calls_last_6_months,num_logins_last_6_months
9510,1149706,7.0,84.0,36.0,U,2.0,28220.40,2.0,5.0
15803,4910229,9.0,115.0,64.5,F,2.0,35873.16,3.0,6.0
49841,2746652,14.0,178.0,74.0,F,2.0,119795.77,2.0,5.0
60649,4624457,14.0,170.0,57.5,U,2.0,41047.00,3.0,3.0
62424,1712565,10.0,122.0,30.5,F,2.0,31567.53,2.0,2.0
3487,8509827,12.0,146.0,47.5,M,2.0,290105.37,6.0,9.0
47222,8661139,11.0,141.0,61.0,F,2.0,210249.39,3.0,6.0
19071,1654715,15.0,189.0,54.5,F,4.0,439603.21,3.0,6.0
25700,7315442,5.0,70.0,53.5,U,2.0,34304.66,5.0,8.0
15381,3987590,10.0,125.0,39.5,M,2.0,45976.63,1.0,4.0
48449,898290,5.0,71.0,29.0,U,2.0,36892.99,0.0,3.0
43292,9048979,5.0,67.0,71.0,M,2.0,36016.83,0.0,3.0
11415,3731627,12.0,150.0,53.5,F,2.0,119442.70,0.0,3.0
1680,6949668,22.0,271.0,61.0,M,3.0,947918.36,4.0,7.0
48904,41652,7.0,86.0,55.0,U,2.0,32307.60,0.0,3.0
12735,3720943,13.0,166.0,65.5,M,2.0,310525.47,2.0,5.0
16740,7264487,4.0,59.0,48.5,U,2.0,115858.81,0.0,3.0
54790,142518,6.0,83.0,39.0,U,4.0,404637.99,6.0,6.0
4999,9724302,21.0,252.0,69.0,F,2.0,61542.08,1.0,4.0
36645,1046160,20.0,250.0,39.5,M,3.0,75903.46,6.0,9.0

### Saving clean csv file

In [14]:
df_final_demo.to_csv('data clean/df_final_demo_clean.csv',index=False)

# Cleaning df_final_experiment_clients

In [15]:
df_final_experiment_clients = pd.read_csv('data raw/df_final_experiment_clients.txt')
df_final_experiment_clients.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [16]:
df_final_experiment_clients.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  70609 non-null  int64
 1   Variation  50500 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.1+ MB

### Dropping the 15 clients with null data from df_final_demo

In [17]:
client_ids_to_remove = [
    7402828, 355337, 8412164, 4666211, 2222915,
    4876926, 5277910, 7616759, 8191345, 1227228,
    8611797, 5144725, 1037867, 1618749, 6021001
]

df_final_experiment_clients = df_final_experiment_clients[
    ~df_final_experiment_clients['client_id'].isin(client_ids_to_remove)
]

In [18]:
df_final_experiment_clients.info()

<class 'pandas.core.frame.DataFrame'>
Index: 70594 entries, 0 to 70608
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  70594 non-null  int64
 1   Variation  50487 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.6+ MB

In [19]:
df_final_experiment_clients.nunique()

client_id    70594
Variation        2
dtype: int64

In [20]:
df_final_experiment_clients['Variation'].unique()

array(['Test', 'Control', nan], dtype=object)

### Renaming column "Variation"

In [21]:
df_final_experiment_clients = df_final_experiment_clients.rename(columns={
    'client_id' : 'client_id',
    'Variation': 'experiment_group'
    })

In [22]:
df_final_experiment_clients.head(10)

   client_id experiment_group
0    9988021             Test
1    8320017             Test
2    4033851          Control
3    1982004             Test
4    9294070          Control
5    9466803             Test
6    3170143             Test
7    6651403          Control
8    5887227             Test
9    2105948          Control

### Saving clean csv file

In [23]:
df_final_experiment_clients.to_csv('data clean/df_final_experiment_clients_clean.csv',index=False)

# Cleaning df_final_web_data_pt_1

In [24]:
df_final_web_data_pt_1 = pd.read_csv('data raw/df_final_web_data_pt_1.txt')
df_final_web_data_pt_1.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [25]:
df_final_web_data_pt_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 343141 entries, 0 to 343140
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     343141 non-null  int64
 1   visitor_id    343141 non-null  object
 2   visit_id      343141 non-null  object
 3   process_step  343141 non-null  object
 4   date_time     343141 non-null  object
dtypes: int64(1), object(4)
memory usage: 13.1+ MB

In [26]:
df_final_web_data_pt_1['process_step'].value_counts()

process_step
start      108910
step_1      73432
step_2      61768
step_3      53628
confirm     45403
Name: count, dtype: int64

In [27]:
df_final_web_data_pt_1['process_step'].unique()

array(['step_3', 'step_2', 'step_1', 'start', 'confirm'], dtype=object)

### Cheching for nulls and duplicates

In [28]:
df_final_web_data_pt_1.isna().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [29]:
df_final_web_data_pt_1[df_final_web_data_pt_1.duplicated(keep=False)]

,client_id,visitor_id,visit_id,process_step,date_time
364,9358626,148475529_63668223960,223297395_36250329195_832161,start,2017-04-28 12:27:28
365,9358626,148475529_63668223960,223297395_36250329195_832161,start,2017-04-28 12:27:28
367,5376894,622509328_44408201172,688984457_43441834354_912755,start,2017-04-28 14:20:01
368,5376894,622509328_44408201172,688984457_43441834354_912755,start,2017-04-28 14:20:01
382,438567,923318467_50708963627,330543236_29863358529_771432,start,2017-04-28 02:52:29
...,...,...,...,...,...
342679,1251269,791822615_78146852845,763845944_55757914723_70888,start,2017-04-28 10:18:20
342684,8350388,304440669_31040182888,143359398_96671536668_299057,start,2017-04-28 12:44:21
342685,8350388,304440669_31040182888,143359398_96671536668_299057,start,2017-04-28 12:44:21
342944,4553664,795008403_33653570753,439592710_65772985411_546352,start,2017-04-28 07:07:17
342945,4553664,795008403_33653570753,439592710_65772985411_546352,start,2017-04-28 07:07:17

In [30]:
df_final_web_data_pt_1.duplicated().sum()

np.int64(2095)

### Dropping duplicated rows

In [31]:
df_final_web_data_pt_1 = df_final_web_data_pt_1.drop_duplicates()

In [32]:
df_final_web_data_pt_1.duplicated().sum()

np.int64(0)

In [33]:
df_final_web_data_pt_1[df_final_web_data_pt_1.duplicated(keep=False)]

Empty DataFrame
Columns: [client_id, visitor_id, visit_id, process_step, date_time]
Index: []

In [34]:
df_final_web_data_pt_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 341046 entries, 0 to 343140
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     341046 non-null  int64
 1   visitor_id    341046 non-null  object
 2   visit_id      341046 non-null  object
 3   process_step  341046 non-null  object
 4   date_time     341046 non-null  object
dtypes: int64(1), object(4)
memory usage: 15.6+ MB

### Dropping the 15 clients with null data from df_final_demo

In [35]:
df_final_web_data_pt_1 = df_final_web_data_pt_1[
    ~df_final_web_data_pt_1['client_id'].isin(client_ids_to_remove)
]

df_final_web_data_pt_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 340959 entries, 0 to 343140
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     340959 non-null  int64
 1   visitor_id    340959 non-null  object
 2   visit_id      340959 non-null  object
 3   process_step  340959 non-null  object
 4   date_time     340959 non-null  object
dtypes: int64(1), object(4)
memory usage: 15.6+ MB

### Cleaning date time

In [36]:
df_final_web_data_pt_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 340959 entries, 0 to 343140
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     340959 non-null  int64
 1   visitor_id    340959 non-null  object
 2   visit_id      340959 non-null  object
 3   process_step  340959 non-null  object
 4   date_time     340959 non-null  object
dtypes: int64(1), object(4)
memory usage: 15.6+ MB

In [37]:
df_final_web_data_pt_1['date_time'] = pd.to_datetime(
    df_final_web_data_pt_1['date_time']
)

In [38]:
df_final_web_data_pt_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 340959 entries, 0 to 343140
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     340959 non-null  int64
 1   visitor_id    340959 non-null  object
 2   visit_id      340959 non-null  object
 3   process_step  340959 non-null  object
 4   date_time     340959 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 15.6+ MB

### Saving clean csv file

In [39]:
df_final_web_data_pt_1.to_csv('data clean/df_final_web_data_pt_1_clean.csv',index=False)

# Cleaning df_final_web_data_pt_2

In [40]:
df_final_web_data_pt_2 = pd.read_csv('data raw/df_final_web_data_pt_2.txt')
df_final_web_data_pt_2.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [41]:
df_final_web_data_pt_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412264 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     412264 non-null  int64
 1   visitor_id    412264 non-null  object
 2   visit_id      412264 non-null  object
 3   process_step  412264 non-null  object
 4   date_time     412264 non-null  object
dtypes: int64(1), object(4)
memory usage: 15.7+ MB

In [42]:
df_final_web_data_pt_2['process_step'].value_counts()

process_step
start      135035
step_1      89761
step_2      71294
step_3      58614
confirm     57560
Name: count, dtype: int64

In [43]:
df_final_web_data_pt_2['process_step'].unique()

array(['confirm', 'step_3', 'step_2', 'step_1', 'start'], dtype=object)

### Cheching for nulls and duplicates

In [44]:
df_final_web_data_pt_2.isna().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [45]:
df_final_web_data_pt_2[df_final_web_data_pt_2.duplicated(keep=False)]

,client_id,visitor_id,visit_id,process_step,date_time
124,3751049,937925261_74821699083,628817270_45049432060_475841,start,2017-05-15 23:09:44
125,3751049,937925261_74821699083,628817270_45049432060_475841,start,2017-05-15 23:09:44
142,9912156,746623513_52101087617,780044921_57678038107_984942,start,2017-05-03 14:09:52
143,9912156,746623513_52101087617,780044921_57678038107_984942,start,2017-05-03 14:09:52
325,5786602,893139880_61416949586,747153834_69434320996_858907,start,2017-05-10 01:49:09
...,...,...,...,...,...
412165,4408245,14058946_73585431797,994148957_84373994761_991865,start,2017-06-06 09:09:44
412166,4408245,14058946_73585431797,994148957_84373994761_991865,start,2017-06-06 08:51:16
412167,4408245,14058946_73585431797,994148957_84373994761_991865,start,2017-06-06 08:51:16
412216,3897324,80177429_24869309091,149796456_64325617570_112561,start,2017-05-04 08:21:30
412217,3897324,80177429_24869309091,149796456_64325617570_112561,start,2017-05-04 08:21:30

In [46]:
df_final_web_data_pt_2.duplicated().sum()

np.int64(8669)

### Dropping duplicated rows

In [47]:
df_final_web_data_pt_2 = df_final_web_data_pt_2.drop_duplicates()

In [48]:
df_final_web_data_pt_2.duplicated().sum()

np.int64(0)

In [49]:
df_final_web_data_pt_2[df_final_web_data_pt_2.duplicated(keep=False)]

Empty DataFrame
Columns: [client_id, visitor_id, visit_id, process_step, date_time]
Index: []

In [50]:
df_final_web_data_pt_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 403595 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     403595 non-null  int64
 1   visitor_id    403595 non-null  object
 2   visit_id      403595 non-null  object
 3   process_step  403595 non-null  object
 4   date_time     403595 non-null  object
dtypes: int64(1), object(4)
memory usage: 18.5+ MB

### Dropping the 15 clients with null data from df_final_demo

In [51]:
df_final_web_data_pt_2 = df_final_web_data_pt_2[
    ~df_final_web_data_pt_2['client_id'].isin(client_ids_to_remove)
]

df_final_web_data_pt_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 403557 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     403557 non-null  int64
 1   visitor_id    403557 non-null  object
 2   visit_id      403557 non-null  object
 3   process_step  403557 non-null  object
 4   date_time     403557 non-null  object
dtypes: int64(1), object(4)
memory usage: 18.5+ MB

### Cleaning date time

In [52]:
df_final_web_data_pt_2.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [53]:
df_final_web_data_pt_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 403557 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     403557 non-null  int64
 1   visitor_id    403557 non-null  object
 2   visit_id      403557 non-null  object
 3   process_step  403557 non-null  object
 4   date_time     403557 non-null  object
dtypes: int64(1), object(4)
memory usage: 18.5+ MB

In [54]:
df_final_web_data_pt_2['date_time'] = pd.to_datetime(
    df_final_web_data_pt_2['date_time']
)

In [55]:
df_final_web_data_pt_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 403557 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     403557 non-null  int64
 1   visitor_id    403557 non-null  object
 2   visit_id      403557 non-null  object
 3   process_step  403557 non-null  object
 4   date_time     403557 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 18.5+ MB

In [56]:
df_final_web_data_pt_2.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

### Saving clean csv file

In [57]:
df_final_web_data_pt_2.to_csv('data clean/df_final_web_data_pt_2_clean.csv',index=False)

# Combining web_data_pt1 and web_data_pt2

In [58]:
df_final_web_data_pt_1_clean = pd.read_csv('data clean/df_final_web_data_pt_1_clean.csv')

In [59]:
df_final_web_data_pt_2_clean = pd.read_csv('data clean/df_final_web_data_pt_2_clean.csv')

In [60]:
df_final_web_data_full = pd.concat(
    [df_final_web_data_pt_1_clean, df_final_web_data_pt_2_clean],
    ignore_index=True
)

In [61]:
df_final_web_data_full.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 744516 entries, 0 to 744515
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     744516 non-null  int64
 1   visitor_id    744516 non-null  object
 2   visit_id      744516 non-null  object
 3   process_step  744516 non-null  object
 4   date_time     744516 non-null  object
dtypes: int64(1), object(4)
memory usage: 28.4+ MB

In [62]:
df_final_web_data_full.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

### Cleaning date time

In [63]:
df_final_web_data_full.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 744516 entries, 0 to 744515
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     744516 non-null  int64
 1   visitor_id    744516 non-null  object
 2   visit_id      744516 non-null  object
 3   process_step  744516 non-null  object
 4   date_time     744516 non-null  object
dtypes: int64(1), object(4)
memory usage: 28.4+ MB

In [64]:
df_final_web_data_full['date_time'] = pd.to_datetime(
    df_final_web_data_full['date_time']
)

In [65]:
df_final_web_data_full.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 744516 entries, 0 to 744515
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     744516 non-null  int64
 1   visitor_id    744516 non-null  object
 2   visit_id      744516 non-null  object
 3   process_step  744516 non-null  object
 4   date_time     744516 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 28.4+ MB

### Cheching for nulls and duplicates

In [66]:
df_final_web_data_full.isna().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [67]:
df_final_web_data_full.duplicated().sum()

np.int64(0)

### Saving clean csv file

In [68]:
df_final_web_data_full.to_csv('data clean/df_final_web_data_full_clean.csv',index=False)